tutorials/porousDamBreak/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousInterIsoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         4.0;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.2;

purgeWrite      0;

writeFormat     ascii;

writePrecision  18;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  no;

maxCo           0.5;
maxAlphaCo      0.5;

maxDeltaT       1;

functions
{
   freeSurface
   {  
       type            surfaces;
       functionObjectLibs
       (  
           "libsampling.so"
       );
       outputControl   outputTime;
       outputInterval  1;
       surfaceFormat  raw;
       fields
       (  
           alpha1
       );
       surfaces
       (  
           freeSurface
           {  
               type        isoSurfaceCell;
               isoField    alpha.water;
               isoValue    0.5;
               interpolate false;
               regularise  false;
           }  
          
           alpha_001
           {  
               type        isoSurfaceCell;
               isoField    alpha.water;
               isoValue    0.01;
               interpolate false;
               regularise  false;
           }          

             alpha_099
           {  
               type        isoSurfaceCell;
               isoField    alpha.water;
               isoValue    0.99;
               interpolate false;
               regularise  false;
           }  
       );
      
   interpolationScheme cell;
   }
}

// ************************************************************************* //
